; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v3)
		(pred_3 ?v2)
		(pred_6 ?v8)
		(pred_1 ?v8)
		(pred_2 ?v2 ?v8)
		(pred_4)
		(pred_5 ?v2))

   (:action op_1
       :parameters  (?v7 ?v4)
       :precondition (and (not-eq ?v7 ?v4) 
                          (pred_6 ?v7) (pred_6 ?v4) (pred_1 ?v7))
       :effect (and  (pred_1 ?v4)
		     (not (pred_1 ?v7))))


   (:action op_2
       :parameters (?v6 ?v1)
       :precondition  (and  (pred_3 ?v6) (pred_6 ?v1)
			    (pred_2 ?v6 ?v1) (pred_1 ?v1) (pred_4))
       :effect (and (pred_5 ?v6)
		    (not (pred_2 ?v6 ?v1)) 
		    (not (pred_4))))

   (:action op_3
       :parameters  (?v6  ?v1)
       :precondition  (and  (pred_3 ?v6) (pred_6 ?v1)
			    (pred_5 ?v6) (pred_1 ?v1))
       :effect (and (pred_2 ?v6 ?v1)
		    (pred_4)
		    (not (pred_5 ?v6)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_02 obj_01 obj_06 
          obj_04 obj_05 obj_03 
)
(:init
(pred_6 obj_02)
(pred_6 obj_01)
(pred_6 obj_06)
(pred_3 obj_04)
(pred_3 obj_05)
(pred_3 obj_03)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(pred_4)
(pred_2 obj_04 obj_01)
(pred_2 obj_05 obj_06)
(pred_2 obj_03 obj_01)
(pred_1 obj_01)
)
(:goal
(and
(pred_2 obj_04 obj_02)
(pred_2 obj_05 obj_06)
(pred_2 obj_03 obj_01)
)
)

(:constraints
  (sometime-before  (pred_2 obj_04 obj_02) (pred_1 obj_06))
)
)

; plan
1. (op_1 obj_01 obj_06)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_06)
   goals met: 2 of 3
2. (op_2 obj_05 obj_06)
   deleted: (pred_2 obj_05 obj_06) (pred_4)
   added: (pred_5 obj_05)
   goals met: 1 of 3
3. (op_1 obj_06 obj_01)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_01)
   goals met: 1 of 3
4. (op_3 obj_05 obj_01)
   deleted: (pred_5 obj_05)
   added: (pred_2 obj_05 obj_01) (pred_4)
   goals met: 1 of 3
5. (op_2 obj_04 obj_01)
   deleted: (pred_2 obj_04 obj_01) (pred_4)
   added: (pred_5 obj_04)
   goals met: 1 of 3
6. (op_1 obj_01 obj_02)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_02)
   goals met: 1 of 3
7. (op_3 obj_04 obj_02)
   deleted: (pred_5 obj_04)
   added: (pred_2 obj_04 obj_02) (pred_4)
   goals met: 2 of 3
8. (op_1 obj_02 obj_01)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_01)
   goals met: 2 of 3
9. (op_2 obj_05 obj_01)
   deleted: (pred_2 obj_05 obj_01) (pred_4)
   added: (pred_5 obj_05)
   goals met: 2 of 3
10. (op_1 obj_01 obj_06)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_06)
   goals met: 2 of 3
11. (op_3 obj_05 obj_06)
   deleted: (pred_5 obj_05)
   added: (pred_2 obj_05 obj_06) (pred_4)
   goals met: 3 of 3
